# Найдите сумму цифр трехзначного числа.
# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0) |

# number = int(input("Введите число: "))
# summa = 0
# while number > 0:
#     ost = number % 10
#     summa = summa + ost
#     number = number // 10
# print(summa)


# Петя, Катя и Сережа делают из бумаги журавликов. Вместе они сделали S журавликов.
# Сколько журавликов сделал каждый ребенок, если известно, что Петя и Сережа сделали одинаковое количество журавликов,
# а Катя сделала в два раза больше журавликов, чем Петя и Сережа вместе?
# 6 -> 1  4  1
# 24 -> 4  16  4
# 60 -> 10  40  10

# count = int(input("Общее колличество журавликов: "))
# print(int(count / 6), int(count * 2 / 3), int(count / 6))


